# ConfusingPadByElementsInDesignOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..ConfusingPadByElementsInDesignOption Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
A pad in the main model cannot be hosted by topography in a Design Option [--if you continue it will not be added to the design option set].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ConfusingPadByElementsInDesignOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConfusingPadByElementsInDesignOption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ConfusingPadByElementsInDesignOption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace